[
    {
        "id": 1,
        "title": "How do you increase sales?",
        "answer": "There are many ways to increase sales, even when working with a limited budget. The best way to increase sales is to grow the number of leads or customers in your sales funnel. By effectively marketing your business you can increase your number of qualified leads and potential sales."
    },
    {
        "id": 2,
        "title": "How do I get more customers for my Business?",
        "answer": "If you have your lead generation strategy and process in place, then it's time to ramp up your marketing efforts to grow the number of leads in your funnel. Identify your target audience and where you can reach them, plan an effective marketing strategy with clear steps and objectives, then implement your strategy and measure its results. At Hubnex we help you to get more customers for your Business."
    },
    {
        "id": 3,
        "title": "What strategies would you use to generate quality leads?",
        "answer": "We are specialized in using digital marketing techniques to generate leads, both for ourselves and our clients. Using a range of methods, from driving organic traffic from Google to creating engaging content on social media, we are able to consistently drive targeted traffic that results in high-quality leads."
    },
    {
        "id": 4,
        "title": "What is Social Media Marketing (SMM)?",
        "answer": "Social Media Marketing (SMM) is a general term used to describe promoting your business on any of the variety of online channels that enable users to create and share content and participate in conversations in public and private communities. There are literally hundreds of social media channels to choose from such as Facebook, Twitter, LinkedIn, Instagram & YouTube."
    },
    {
        "id": 5,
        "title": "Is it worth it to advertise on Facebook?",
        "answer": "Allocating a budget to Facebook Advertising can be very worthwhile with an effective strategy set up. With ads you can reach your target audience through selecting an area, an age range and even a number of different spoken languages. You can control who sees your product, which will ultimately boost your website traffic and your conversions."
    },
    {
        "id": 6,
        "title": "Is Digital Marketing cost effective?",
        "answer": "Yes, digital marketing is one of the most cost-effective forms of marketing available to businesses. It's easier to accurately measure the results of your marketing campaigns than other traditional forms of marketing, which allows you to make informed decisions about the value it provides. A well-planned digital marketing campaign can result in significant returns when implemented effectively for a relatively modest investment."
    },
    {
        "id": 7,
        "title": "How long does a new website take to design & develop?",
        "answer": "2 days to 1 year, depends on the website."
    }
]